InScentTiveWeb/app/Models/User_model.php

SELECT *
FROM `user`
---
    function getUserInfo()
    {
        $builder = $this->db->table('user');

        $res = $builder->get()->getResult();

SELECT *
FROM `user`
WHERE `userID` = '1'
---
    function getUserInfoBySN($SN)
    {
        $builder = $this->db->table('user');
        $builder->where('userID', $SN);
        $res = $builder->get()->getRow();

INSERT INTO `user` (`name`, `fullName`, `email`, `password`) VALUES ('takoy', 'John', 'john@mark.penales', 'password')
---
    function insertUserRecord($data)
    {
        $builder = $this->db->table('user');
        $res = $builder->insert($data);

UPDATE `user` SET `name` = NULL, `fullName` = NULL, `email` = NULL, `password` = NULL
WHERE `userID` = '2'
---
    function updateUserRecord($data, $SN)
    {
        $builder = $this->db->table('user');
        $builder->set($data);
        $builder->where('userID', $SN);
        $res = $builder->update($data);

DELETE FROM `user`
WHERE `userID` = '1'
---
    function deleteUserRecord($SN)
    {
        $builder = $this->db->table('user');
        $builder->where('userID', $SN);
        $res = $builder->delete();